[
  {
    "title": "Launch announcement!",
    "link": "https://store.steampowered.com/news/app/3835670/view/600794965688188932",
    "pubDate": "November 12, 2025",
    "content": "<div class=\"bb_h2\">TEKO will be launched on March 13, 2016</div><div onclick=\"javascript:ReplaceWithYouTubeEmbed( this );\" data-youtube=\"au3KDE8622w\" class=\"sharedFilePreviewYouTubeVideo sizeFull\"><img class=\"sharedFilePreviewYouTubeVideo sizeFull\" src=\"https://steamcommunity.com/public/shared/images/responsive/youtube_16x9_placeholder.gif\"/><iframe src=\"https://www.youtube-nocookie.com/embed/au3KDE8622w?fs=1&modestbranding=1&rel=0\" allowFullScreen=\"1\" frameBorder=\"0\"></iframe></div><br><div class=\"bb_h3\"><b><a class=\"bb_link\" href=\"https://steamcommunity.com/linkfilter/?u=https%3A%2F%2Fdiscord.com%2Finvite%2FXk8RxfWBn6\" target=\"_blank\" rel=\" noopener\" >Don't forget to join Discord.</a></b></div><b><a class=\"bb_link\" href=\"https://steamcommunity.com/linkfilter/?u=http%3A%2F%2Fwww.patreon.com%2Fc%2FTalioGames\" target=\"_blank\" rel=\" noopener\" >You can also support me on Patreon!</a></b>"
  },
  {
    "title": "u3.2",
    "link": "https://store.steampowered.com/news/app/3835670/view/658213406635985165",
    "pubDate": "October 21, 2025",
    "content": "<div class=\"bb_h3\">TEKO u3.2</div>'Outline' system reworked. Previously it was more like an 'Outglow'. Now every element has a solid outline when hovered or selected, greatly improving visibility. I also reworked all their colors.<br>Added a relief (button-like) effect to all in-game buttons.<br>Wobbly Card no longer deletes mods. If there's free space, they are restored after the card is removed.<br>Fixed 'Loudmouth' interaction, now it stacks previously played combos without needing to have the card.<br>The goal point deduction sound now plays earlier to better match the text animation.<br>Added Cam Mode: content creators now have a dedicated space for their camera in the top-right corner. This mode is disabled during the tutorial.<br>Changes to forbidden cards: their appearance rate was increased (from 0.1% to 0.25%), and when they trigger, they automatically unlock a card slot. If no space is available, they replace the leftmost card.<br>Fixed the tooltip description for the Empanada Race Pack in the Codex.<br>The Codex will now remain hidden for new players.<br>Codex item names were only showing in English, now this is fixed.<br>Performed several code optimizations to improve performance on low-end PCs.<br>Changed button colors in the main menu.<br>Fixed the 'Add Card Slot' button in the shop.<br>Changed the tooltip background color.<br>New adaptive text sizing system: all texts now scale responsively within their frames and share a unified size, creating a beautiful visual harmony.<br>Reworked all texts, now they all start with uppercase letters.<br>Improved the appearance of the Settings screen."
  },
  {
    "title": "u3.1",
    "link": "https://store.steampowered.com/news/app/3835670/view/543369627969783504",
    "pubDate": "October 06, 2025",
    "content": "<div class=\"bb_h3\">TEKO u3.1</div>Fixed music bug (the gameplay screen track was mistakenly placed in the sound effects audiogroup instead of the music one, causing multiple issues — an organization error).<br>The settings button now correctly appears on the screen after winning a round.<br>Fixed a visual artifact on the blender selection screen.<br>Now, when exiting and re-entering in the middle of a round, the remaining score will be saved. Previously, it unintentionally reset.<br>Made small adjustments to the overall OST gain.<br>The number of turns played in a round now updates correctly.<br>Fixed the rarity text of mods on the blender results screen.<br>Improved the description of the Profit Seeker Card.<br>Fixed tooltips in the pocket viewer.<br>Outlay consumable corrected, it now works properly.<br>Added more left and right click sounds. Empty spots are now less noticeable, as some buttons previously lacked sound. A few effects may still be missing, but it's much better now.<br>Created new logic to prevent click sounds from overlapping and playing multiple times simultaneously.<br>Compressed several files, optimized texture pages, and reduced image sizes. The compressed game now weighs 18MB, this is a great achievement.<br><br>Main Menu visuals reworked!<br>The scenery now includes clouds, the sky is darker, the horizon is flat, the road is better paved, Pixi was redrawn from scratch, and the Elite Tower is now more faithful to the canon (at night, it has a crystal-like appearance). The result is beautiful — I’m much happier with the main menu’s aesthetics. I’d wanted to do this for a long time. I also optimized image sizes: the menu went from 6MB down to 1MB."
  },
  {
    "title": "u3.0",
    "link": "https://store.steampowered.com/news/app/3835670/view/543369627969783416",
    "pubDate": "October 04, 2025",
    "content": "<div class=\"bb_h1\">TEKO u3.0</div><div class=\"bb_h3\">Most important changes:</div>Completely revamped OST! I stopped using placeholders — all the music is now fully composed by me from scratch.<br>Added track variations for specific events (when you’re on your last attempt before losing, the music will change).<br>New sounds added.<br>Added LATAM Spanish.<br>All windowed mode controls are now visible: you can move, resize, and use the maximize/minimize/close buttons.<br><div class=\"bb_h3\">Other changes:</div>Fixed some translations that weren’t properly defined in the code.<br>Fixed the positioning and text of the notification box.<br>Several interactions now appear as notifications instead of full-screen text.<br>Fixed parts of the tutorial that froze when selecting chips.<br>Fixed many bugs where card tooltips appeared behind other scenes.<br>Fixed the Castle consumable, it no longer breaks your plays.<br>Using the Delete Pack no longer auto selects a chip.<br>Repositioned buttons in the settings screen.<br>Added a sprite for the Codex (previously just a text button).<br>Added new graphical elements to the main menu.<br>Improved the text on the Blender selection screen."
  },
  {
    "title": "u2.3",
    "link": "https://store.steampowered.com/news/app/3835670/view/543368994111883006",
    "pubDate": "September 20, 2025",
    "content": "<div class=\"bb_h3\">TEKO u2.3</div>Fixed consistent issue: the run was saved regardless of winning/losing and could be resumed instead of wiping all data. In other words, after finishing a run it was possible to replay the last round played (exploit).<br><br>Nerfed Empanada Race: it was very unbalanced, and I didn’t consider that the system scaled too much. The consolation prize was removed and a -$1 penalty per race played on loss was added."
  },
  {
    "title": "u2.2",
    "link": "https://store.steampowered.com/news/app/3835670/view/543368994111881220",
    "pubDate": "September 17, 2025",
    "content": "<div class=\"bb_h3\">TEKO u2.2</div>Fixed an exploit that allowed players to indefinitely buy items to obtain infinite copies of the same item.<br>Fixed the item 'reservation' system bug that occurred when exiting to the menu and returning while not in the shop.<br>Fixed the positioning of some items that would appear in strange ways after exiting and re-entering the game.<br>Maximum mana and maximum discards are now saved correctly. Previously, there were bugs related to this when exiting and re-entering the game.<br>The 'Color Tubes' efficiency Perk now subtracts -1 from the multicolor tube instead of -2.<br>Added text indicators (x/x) in the shop inventories to show the current and maximum number of items.<br>Players can now go into debt by betting on empanada races.<br>Finally fixed the expenses and earnings for the empanada race. The buff has been finished and now works as it should have from the beginning.<br>Fixed an issue with the 'Dice' consumable where it could reroll a card into a card the player already owned, which wouldn't work if duplicated. For example, if the player has the Lankvian Card and uses the Dice on an epic card, Lankvian Card will not appear again, as it doesn't function when duplicated.<br>The 'Continue' button no longer appears in the main menu after finishing a run.<br>The 'Outlay' and 'Castle' consumables can now stack correctly and be used multiple times at once.<br>Removed the 'Codex' button from within the tutorial, as it was causing several bugs.<br>The tutorial now correctly deletes progress from the current run. A tooltip has been added to notify players of this if they have an unfinished standard run.<br>The tutorial now properly deletes its own progress if exited and re-entered to prevent bugs.<br>Now it's possible to access the Settings screen from the tutorial shop. The button was previously visible but unclickable."
  },
  {
    "title": "u2.1",
    "link": "https://store.steampowered.com/news/app/3835670/view/787688820859470167",
    "pubDate": "September 12, 2025",
    "content": "<div class=\"bb_h3\">TEKO u2.1</div>Fixed the 'reserve' function in the shop. Previously, upon reaching the next shop, the item would not be saved but the money would be spent anyway. This bug was urgently fixed.<br>Fixed the interaction with the Pirinola in the shop. Now it can only be clicked after the other animations finish. Before, for example, a consumable could get stuck on the screen when purchased and instantly clicking the pirinola.<br>The correct number of chips in the pocket is now displayed in the shop.<br>Fixed the Greedy Card's tooltip and added a clarification to its text.<br>Improved the tooltip text for the empanada race pack.<br>Buff to the Pirinola: it now gives more money.<br>Empanada races now give a random pack as a consolation prize after losing.<br>The appearance percentages of Mods and Cards in the shop and in packs have been improved.<br>The prices of these items have been reduced: Upgrade packs (safe/risk), Stickers, Chips."
  },
  {
    "title": "u2.0",
    "link": "https://store.steampowered.com/news/app/3835670/view/516346126609156167",
    "pubDate": "September 09, 2025",
    "content": "<div class=\"bb_h1\">TEKO u2.0</div><b>I made too many changes, so I'll just summarize them, because I don't think a very detailed log is worth it. I've made so many patches that I've decided to list the changes in the order I made them.</b><br><ul class=\"bb_ul\"><li> We have a new cursor! No more of the operating system's default one.<br></li><li> Fixed multiple interactions and visual issues with cards and consumables.<br></li><li> Changed the visual system for potions and their container (it used to be a simple square).<br></li><li> Added important clarifications in the tooltips of many items, corrected several descriptions, and improved the entire text system in general.<br></li><li> Changed most of the graphics, the buttons, almost the entire interface, the size of the money, the graphics of the colored tubes, the menus, etc. I would be detailing this point for 20 lines, so I'll just say that the visual change was enormous.<br></li><li> Removed and reworked many elements of the shop. Right now, the options for Blender, Empanada Race, Upgrade, and Remove chips no longer exist. They have become packs. Also, the entire shop now looks different, with more visual harmony, much easier to view.<br></li><li> Buff to rounds: it now costs fewer points to get further. Nerf: now for each combo level gained, the goal will increase by 1%. Also, a bug has been fixed that made subsequent rounds smaller than the current one. The difficulty now scales better.<br></li><li> Help Screen removed. It was useless LOL. I've done the same with the 'Pre Play Screen', which is now compacted into the shop itself.<br></li><li> Removed the tooltip (ON/OFF) options. They were confusing and added nothing. I also added more colors and new tooltips. And they work better. The text is also smaller (it used to take up too much of the screen).<br></li><li> Added a new button to see what Perks the player currently has. Very useful for knowing how to play better by taking advantage of the resources.<br></li><li> Empanada Race totally reworked, now the chances change as more races are played, and it also gives more money.<br></li><li> Reworked card slots and the number of slots that mods occupy. Pro Mods now take up 3 slots instead of all of them, and Common and Rare mods only take up 1.<br></li><li> Several prices in the shop changed, by a very small difference. Several appearance rates have also been nerfed.<br></li><li> Reserving items in the shop now costs money (every time you reroll or re-enter the shop, the player will lose $1 for each reserved item).<br></li><li> Total rework of the rarity of many cards, almost half of them.<br></li><li> Rework of many card values. I have nerfed the multi a lot, several descriptions, and quite a few values.<br></li><li> The first integration of the game with Discord is now done. It's reasonably okay but may contain some synchronization errors.<br></li><li> Changed the stock and diversity system for Mods, Consumables, and Packs. They now appear differently in the shop when rerolling.<br></li><li> Nerfed the combo level-up, it now scales a bit less.<br></li><li> Fixed a bug with the music volume (when at 0%, it couldn't be turned back on).<br></li><li> Entire tutorial reworked. It now contains a ton of help for new players, and it also highlights the objects you need to click. In short: it's a dynamic run that provides the essential help for a player to start playing TEKO.<br></li><li> All accumulation cards will now be able to accumulate beforehand without having them in the inventory yet. This allows the system to be fairer, and for example, allows the player to play a specific build without having to force it from the early game.<br></li><li> Improved the save/continue system. I currently feel it's at 99%. It might have some bugs, but it's more reliable now.<br><br><i>These summarized patch notes have taken me a lot of time. We are very close to the first public demo version.</i><br><br>As a curiosity: in the last few patches, the statistics haven't been very optimal. We'll see how player progress advances with this big patch.<br><br>From u1.0 to u2.0, only 56 games were played, with 13 wins and 43 losses, resulting in a 23% winrate. The most used cards were Trixi (14), Near the Edge (11), Symmetry (10), Buoyant (9). The highest score achieved in the last round was 2,144,521,614,024! I noticed that these patches were very broken, I know, it was done on purpose. From the beginning I planned to make the game unbalanced to find out which features were the most exaggerated. Thanks to this feedback, I have been able to change many things for the good of the gameplay mechanics.<br><br>Thanks for everything. I will keep working. Enjoy this u2.0.</li></ul>"
  },
  {
    "title": "u1.2",
    "link": "https://store.steampowered.com/news/app/3835670/view/516344858807369732",
    "pubDate": "August 19, 2025",
    "content": "<div class=\"bb_h3\">TEKO u1.2</div><p class=\"bb_paragraph\">I just finished fixing all the sticker functions. All sticker types now work correctly, and they can even be retriggered. Previously, Knife/Duplicator/Retrigger stickers didn’t work at all. Now it’s possible to create builds using these playable elements.</p>"
  },
  {
    "title": "u1.1",
    "link": "https://store.steampowered.com/news/app/3835670/view/812455995175338954",
    "pubDate": "August 19, 2025",
    "content": "<div class=\"bb_h3\">TEKO u1.1</div><p class=\"bb_paragraph\"><i>I had some issues, especially after adding more content to the game.</i></p><p class=\"bb_paragraph\"><b>So I finally decided to fix all the duplicate cards that weren’t working.</b></p><p class=\"bb_paragraph\">Forbidden cards CANNOT be duplicated.</p><p class=\"bb_paragraph\">Some cards are now locked from being duplicated because it wouldn’t make sense to have more than one.</p><p class=\"bb_paragraph\"></p><div class=\"bb_h3\">Fixed cards:</div><p class=\"bb_paragraph\">potentially suspicious man, kurosawa, olga, naughty, kito, kimi, final sacrifice, greedy, idle overlord, perfection, yapa, sobriety, club sandwich, roulette, mogul, profit seeker, mortgage, tryhard, near the edge, let me cook, detachment, alchemy.</p><div class=\"bb_h3\">Locked cards:</div><p class=\"bb_paragraph\">empanadino, sale, cheapskate, lankvian.</p><p class=\"bb_paragraph\"></p><p class=\"bb_paragraph\">All cards are now working.</p>"
  }
]